package com.lenovocw.utils;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import java.util.Random;

public class RandomName {
	//百家姓单性
	public static final String [] DXing={
		"赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨",
		"朱","秦","尤","许","何","吕","施","张","孔","曹","严","华","金","魏","陶","姜",
		"戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎",
		"鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐",
		"费","廉","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常",
		"乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄",
		"和","穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧",
		"计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒","屈","项","祝","董","梁",
		"杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜","郭",
		"梅","盛","林","刁","钟","徐","邱","骆","高","夏","蔡","田","樊","胡","凌","霍",
		"虞","万","支","柯","咎","管","卢","莫","经","房","裘","缪","干","解","应","宗",
		"宣","丁","贲","邓","郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚",
		"程","嵇","邢","滑","裴","陆","荣","翁","荀","羊","於","惠","甄","魏","加","封",
		"芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓",
		"牧","隗","山","谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫",
		"宁","仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","姜","詹","束","龙",
		"叶","幸","司","韶","郜","黎","蓟","薄","印","宿","白","怀","蒲","台","从","鄂",
		"索","咸","籍","赖","卓","蔺","屠","蒙","池","乔","阴","郁","胥","能","苍","双",
		"闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵","冉","宰","郦","雍",
		"却","璩","桑","桂","濮","牛","寿","通","边","扈","燕","冀","郏","浦","尚","农",
		"温","别","庄","晏","柴","瞿","阎","充","慕","连","茹","习","宦","艾","鱼","容",
		"向","古","易","慎","戈","廖","庚","终","暨","居","衡","步","都","耿","满","弘",
		"匡","国","文","寇","广","禄","阙","东","殴","殳","沃","利","蔚","越","夔","隆",
		"师","巩","厍","聂","晁","勾","敖","融","冷","訾","辛","阚","那","简","饶","空",
		"曾","毋","沙","乜","养","鞠","须","丰","巢","关","蒯","相","查","后","江","红",
		"游","竺","权","逯","盖","益","桓","公","万","俟","仉","督","晋","楚","阎","法",
		"岳","帅","墨","哈","谯","笪","年","爱","阳","佟","言","福","归","海","谷","粱",
		"缑","亢","商","牟","佘","佴","伯","赏"
		};
	//百家姓复姓
	public static final String [] FXing={
		"宇文","尉迟","延陵","羊舌","羊角","乐正","诸葛","颛孙","仲孙","仲长","长孙","钟离",
		"宗政","左丘","主父 ","宰父","子书","子车","子桑","百里","北堂","北野","哥舒","谷梁",
		"闻人","王孙","王官","王叔","巫马","微生","淳于","单于","成公","叱干","叱利","褚师",
		"端木","东方","东郭","东宫","东野","东里","东门","第二","第五","公祖","公玉","公西",
		"公孟","公伯","公仲","公孙","公广","公上","公冶","公羊","公良","公户","公仪","公山",
		"公门","公坚","公乘","欧阳","濮阳","青阳","漆雕","壤驷","上官","司徒","司马","司空",
		"司寇","士孙","申屠","叔孙","叔仲","侍其","令狐","梁丘","闾丘","刘傅","慕容","万俟",
		"谷利","高堂","南宫","南门","南荣","南野","女娲","纳兰","澹台","拓跋","太史","太叔",
		"太公","秃发","夏侯","西门","鲜于","轩辕","相里","皇甫","赫连","呼延","胡母","亓官",
		"夹谷","即墨","独孤","段干","达奚","汝鄢","涂钦","况后","有琴","拓拔","归海","爱新觉罗"
	};
	//颜色
	public static final String [] Yanse={
		"红","橙","黄","绿","紫","蓝","黑","白","咖啡","灰","绯","粉","棕"
	};
	//名字
	public static final String [] Changyong={
		"天空","飞鸟","飞鱼","寂寞","萝莉","耍帅","红叶","烟鬼","酒鬼","新欢","love",
		"飞翔","懒人","补丁","咖啡","奶茶","蛋挞","悲剧","崇拜","中意","烟鬼","戒爱",
		"忘情","煅情","练爱","实习生","王子","公主","靠靠","大爷","妹妹","哥哥","疯子",
		"白开水","国宝","爱唱歌","爱pk","爱围观","爱八卦","爱娱乐","爱音乐","爱运动","爱自己",
		"向东","向南","向西","向北","向前","向后","向钱","左岸","右岸","左手","右手","牵手",
		"牵你左手","欠你右手","欠你一个拥抱","最后的温存","最后的温柔","上天","霸天","逆天","霸业",
		"亡者","王者","幽灵","逗号","句号","未完待续","大眼睛","哥","崇拜","别崇拜哥","御姐",
		"哥只是传说","别崇拜姐","姐姐是传说"
	};
	
	public static final String [] Fuming={
		"菲菲","姗姗","彤彤","爱爱","小小","萧萧","笑笑","晓晓","乐乐","姗姗","杉杉","琳琳",
		"霖霖","粼粼","彬彬","斌斌","贝贝","北北","宝宝","抱抱","饱饱","爆爆","爱爱","温柔",
		"酷酷","苦苦","裤裤","哈哈","嘿嘿","红红","虹虹","宏宏","兰兰","蓝蓝","懒懒","寂寞"
	};
	
	public static final String [] Xiangyan={
		"雪茄","黑曼","白曼","中华烟","熊猫","蝴蝶","红双喜"
	};
	
	public static final String [] Jiu={
		"老白干","哈啤","五粮液","二锅头","葡萄干红","路易十六","剑兰春","龙泉春"
	};
	
	public static final String [] Biaoq={
		"o(︶︿︶)o ","ヽ(ˋДˊ)ノ","ヽ(ˋ▽ˊ)ノ","°(°ˊДˋ°)°","┑(￣▽ ￣)┍ ","┑(￣Д ￣)┍ ",
		"┑(￣。。￣)┍ ","╮(╯Д╰)╭","╮(╯▽╰)╭","(≥﹏ ≤)","(￣ε ￣)","乀(ˉεˉ乀)","～(￣▽￣～)",
		"(～￣▽￣)～","(*▔＾▔*)","\\(▔＾▔)/","\\(▔＾▔)/","\\(▔＾▔)/","↖(▔＾▔)↗ ","ㄟ(▔,▔)ㄏ ",
		"\\(▔▽▔)/","↖(▔▽▔)↗","ㄟ(▔▽▔)ㄏ","ㄟ(▔＾▔ㄟ)","(╯▔＾▔)╯","ㄟ(▔皿▔ㄟ)","(╯▔皿▔)╯",
		"ㄟ(▔（▔ㄟ)","(╯▔（▔)╯","ㄟ(▔▽▔ㄟ)","(╯▔▽▔)╯","ㄟ(▔〔▔ㄟ)"," (╯▔〔▔)╯","(～o▔▽▔)～o",
		" o～(▔▽▔o～)","(╬▔＾▔)凸","⊙▂⊙","⊙０⊙","⊙＾⊙","⊙﹏⊙","?▽?","∩▂∩","●▂●","●﹏●",
		"≥▂≤","≥０≤","≥＾≤","≥ω≤","≥﹏≤","≥△≤","≥▽≤ ","＞▂＜","＞＾＜","╯▂╰","╯＾╰","＋▂＋","＋﹏＋",
		"ˋ＾ˊ","ˇ﹏ˇ","˙﹏˙","ˇ＾ˇ","o(?\"\"?)o","(-__-)b","(#｀′)凸","(#｀′)凸","<。)#)))≤","(??)nnn",
		"\\(0^◇^0)/","<*)>> >=<","(=^ ^=)","/(*w*)\\","≡[。。]≡","(ˉ(∞)ˉ)","--<-<-<@","(≥▽≤)",
		"#^_^#","~*.*~","∩__∩","╯﹏╰"
	};
	
	private static String getString (String [] [] str){
		Random r=new Random();
		int index=r.nextInt(str.length);
		int index1= r.nextInt(str[index].length);
		return str[index][index1];
	}
	
	private static String getString (List<String> list){
		Random r=new Random();
		int index=r.nextInt(list.size());
		return list.get(index);
	}
	
	public static final String [] [] XING={DXing,FXing};
	public static final String [] [] MING={Yanse,Changyong,Fuming,Xiangyan,Jiu};
	public static final List<String> list=new ArrayList<String>();
	static {
		list.addAll(Arrays.asList(Yanse));
		list.addAll(Arrays.asList(Changyong));
		list.addAll(Arrays.asList(Fuming));
		list.addAll(Arrays.asList(Xiangyan));
		list.addAll(Arrays.asList(Jiu));
	}
	
	public static String getRandomName(){
		return getString(XING)+"."+getString(list);
	}
	
	public static void main(String[] args) {
		for(int i=0;i<100;i++){
			System.out.println(RandomName.getRandomName());
		}
	}
}
